from product import Product
from orders import Order, Orders


print('Paragraph 1')
# створила обє"кт типу Product
p = Product('Борошно', 15)
# вивила у консолі інформацію про обєкт
print(p)
# застосувала  функцію для зміни системи вимірювання кг - г та вивила інформацю про обєкт
p.set_weight_type('г')
print(p)
# застосувала функцію для зміни системи вимірювання г - ц та вивила інформацю про обєкт
p.set_weight_type('ц')
print(p)
# застосувала функцію для зміни системи вимірювання ц - кг та вивила інформацю про обєкт
p.set_weight_type('кг')
print(p)
# застосувала перевикористаний оператор множення шкала відстоків від 1-100 та вивила інформацю про обєкт
p *= 100
print(p)
print('===================================')


print('Paragraph 2')
# створила обє"кти типу Order
p = Order('Борошно', 15, 10, weight_type='кг')
d = Order('Цукор', 25, 20, weight_type='кг')
r = Order('Рис', 30, 5, weight_type='кг')
print(p)
print(d)
print(r)
# застосувала функцію для отримання вартості замовлення
print(p.count_sum())
print(d.count_sum())
print(r.count_sum())
# застосувала перевикористаний оператор білше рівне для порівняння замовлень за вартістю
if p >= d:
    print(f'загальна вартість замовлення {p.name} більше рівна ніж у замовлення {d.name}')
else:
    print(f'загальна вартість замовлення {p.name} не більше рівна ніж у замовлення {d.name}')

if p >= r:
    print(f'загальна вартість замовлення {p.name} більше рівна ніж у замовлення {r.name}')
else:
    print(f'загальна вартість замовлення {p.name} не більше рівна ніж у замовлення {r.name}')
print('===================================')

print('Paragraph 3')
# створила обє"кт типу Orders
o = Orders()

# додаю замовлення за допомогою метода додати
o.add(p)
# додаю список із замовленнь за допомогою превантажиного оператора додавання

o += [d, r]

# використовую метод для вирахування загальної суми замовлення
print(o.total_sum())

# виводжу чек для замовлення
print(o)
print('===================================')






